art/note/j11.org
#+HTML_HEAD: <link rel = "stylesheet" type="text/css" href ="style_for_org.css"/>
#+OPTIONS: html-style:nil
#+TITLE: Chapter 11:Generics and reflections


* 泛型

** 什么是泛型? 

泛型是一种编程语言特性，它允许在代码中使用未知的类型。通常情况下，泛型允许我们声明一个函数、类或接口时不指定具体类型，而是在调用时才确定类型。这样可以提高代码的可重用性和灵活性，同时也能避免出现类型不匹配的错误。

例如，在 Java 中，我们可以声明一个泛型类来表示某个类型的栈（stack）：

#+BEGIN_SRC 
public class Stack<T> {
    private T[] elements;
    private int size;

    public void push(T element) {
        // 将元素压入栈顶
    }

    public T pop() {
        // 从栈顶弹出一个元素并返回
    }
}
#+END_SRC
在上面的例子中， ~T~ 是一个类型参数，它表示某个具体的类型。当我们实例
化一个 ~Stack~ 对象时，需要为 ~T~ 指定一个具体的类型，例如：
#+BEGIN_SRC 
Stack<Integer> intStack = new Stack<Integer>();
intStack.push(1);
intStack.push(2);
intStack.pop(); // 返回2
#+END_SRC
在这个例子中，我们将 ~T~ 指定为 ~Integer~ 类型，因此 ~intStack~ 对象只
能存储整数类型的元素。如果我们尝试将其他类型的元素压入栈中，就会编译错
误。

** 能够给我一个泛型类的例子吗?

如上就是

** 能够定义一个有着多个泛型的类吗?

可以.

是的，可以定义一个使用了多个泛型的类。这种类被称为 "泛型类" 或 "参数化
类型"。在 Java 中，我们可以使用尖括号来指定多个类型参数，例如：
#+BEGIN_SRC 
public class Pair<K, V> {
    private K key;
    private V value;

    public Pair(K key, V value) {
        this.key = key;
        this.value = value;
    }

    public K getKey() {
        return key;
    }

    public V getValue() {
        return value;
    }
}
#+END_SRC
在上面的例子中， ~Pair~ 类使用了两个类型参数 ~K~ 和 ~V~ ，它们分别表示
键和值的类型。当我们实例化一个 ~Pair~ 对象时，需要为 ~K~ 和 ~V~ 指定具
体的类型，例如：
#+BEGIN_SRC 
Pair<String, Integer> pair = new Pair<>("foo", 42);
String key = pair.getKey();
Integer value = pair.getValue();
#+END_SRC
在这个例子中，我们将 ~K~ 指定为 ~String~ 类型， ~V~ 指定为 ~Integer~
类型。因此， ~pair~ 对象表示一个字符串键对应一个整数值的键值对。

** 泛型方法是什么?

参数是泛型的方法就是泛型方法.

泛型方法是一种使用泛型的方法，它允许在方法中使用未知的类型。通常情况下，
泛型方法用于实现算法或操作，以便能够处理各种类型的数据。

例如，在 Java 中，我们可以声明一个泛型方法来比较两个对象的值是否相等：
#+BEGIN_SRC 
public static <T> boolean isEqual(T t1, T t2) {
    return t1.equals(t2);
}
#+END_SRC


在上面的例子中， ~isEqual ()~ 方法使用了一个类型参数 ~T~ ，它表示某个具体
的类型。当我们调用 ~isEqual ()~ 方法时，需要为 ~T~ 指定一个具体的类型，例
如：
#+BEGIN_SRC 
String str1 = "hello";
String str2 = "world";
boolean result = isEqual(str1, str2);  // 返回false

Integer num1 = 42;
Integer num2 = 42;
boolean result = isEqual(num1, num2);  // 返回true
#+END_SRC

在这个例子中，我们分别将 ~str1~ 和 ~str2~ 作为字符串参数传递给
~isEqual ()~ 方法，并将 ~num1~ 和 ~num2~ 作为整数参数传递给 ~isEqual
()~ 方法。由于 ~isEqual ()~ 方法使用了泛型，所以它可以接受任何类型的参
数，只要这些参数类提供了 equals () 方法的实现。

** 使用泛型的时候有什么约束和限制？

1. 无法使用基本数据类型作为泛型类型参数。只能使用对应的包装类（如
   Integer、Boolean 等）。

2. 无法创建泛型类型参数的实例。例如，不能直接使用 new T() 创建一个泛型
   类型参数 T 的实例，因为在编译时无法确定具体的类型。

3. 在运行时无法获取泛型参数的具体类型信息。这是因为 Java 中的泛型是通
   过类型擦除来实现的，在编译时会将泛型类型转换为原始类型，并且在运行
   时不再保留类型参数的具体信息。

4. 泛型参数不能使用在静态上下文中。静态方法或静态变量无法引用泛型类型
   参数。


*** 泛型参数不能使用在静态上下文中。静态方法或静态变量无法引用泛型类型参数。

这句话的意思是，在静态方法或静态变量中无法使用泛型类型参数。

在 Java 中，静态方法和静态变量属于类级别，而不属于对象级别。因此，它们
不能访问对象的实例变量或实例方法，只能访问静态变量和静态方法。而泛型类
型参数是在实例级别上定义的，因此在静态上下文中无法引用泛型类型参数。

例如，下面的代码就会编译错误：
#+BEGIN_SRC 
public class MyClass<T> {
    private static T staticVar;
    public static void staticMethod(T arg) { // 编译错误：无法在静态上下文中使用泛型类型参数
        // ...
    }
}
#+END_SRC
解决这个问题的常见方法是将泛型类型参数替换为具体的类型或限定类型。例如，
可以将上面的代码改为：
#+BEGIN_SRC 
public class MyClass<T> {
    private static T staticVar; // 可以使用 T 的限定类型
    public static <E> void staticMethod(E arg) { // 可以使用新的类型参数 E
        // ...
    }
}
#+END_SRC
总之，由于泛型类型参数是在实例级别上定义的，所以在静态上下文中无法使用
它们。必须使用其他方式来代替泛型类型参数，以确保正确地使用静态方法或静
态变量。


** 泛型接口

泛型接口是一种接口，其定义中使用了一个或多个类型参数来表示具体的类型，
并且这些类型可以在实现该接口的类中指定。通过使用泛型接口，我们可以将接
口与特定类型的实现分离开来，从而提高代码的可重用性和灵活性。在 Java 语
言中，泛型接口可以使用如下语法进行定义：
#+BEGIN_SRC 
interface MyInterface<T> {
    T myMethod(T arg);
}
#+END_SRC
在上面的例子中， ~MyInterface~ 是一个泛型接口，它有一个类型参数 ~T~ ，
在 ~myMethod~ 方法中使用了这个类型参数来表示参数类型和返回值类型。在实
现 ~MyInterface~ 接口时，需要指定具体的类型来替换 ~T~ 。例如，如果我们
想让 ~MyInterface~ 接口的实现类操作字符串类型，可以这样定义：
#+BEGIN_SRC 
class MyString implements MyInterface<String> {
    @Override
    public String myMethod(String arg) {
        // ...
    }
}
#+END_SRC
在这个例子中， ~MyString~ 是 ~MyInterface~ 接口的实现类，它将 ~T~ 替换
为 ~String~ 类型，并实现了 ~myMethod~ 方法。


值得注意的是, 泛型类实现了泛型接口的, 那么类的泛型的符号应该和接口的泛
型的符号一致.

* 泛型的通配符

** 什么是泛型的通配符?

泛型的通配符指的是 Java 中用于表示未知类型的符号。它们允许我们编写可以
处理不同数据类型的代码，从而提高了代码的重用性和灵活性。

Java 中有两种形式的泛型通配符：问号（ ~?~ ）和上限通配符（ ~extends~ ）。

问号通配符（ ~?~ ）可以用来表示任何类型，例如：
#+BEGIN_SRC 
List<?> list;
#+END_SRC

在这个例子中，我们定义了一个 ~List~ 类型的变量 ~list~ ，并使用问号通配
符来指示它可以持有任何类型的元素。这意味着我们可以将任何类型的列表分配
给此变量，例如 ~List<String>~ 或 ~List<Integer>~ 等。

上限通配符（ ~extends~ ）用于限制泛型类型参数的范围。例如，假设我们有
以下类层次结构：
#+BEGIN_SRC 
class A {}
class B extends A {}
class C extends A {}
#+END_SRC
现在，我们想要一个方法来接受一个 ~List~ ，该列表只包含 ~A~ 类及其子类
的对象。我们可以使用上限通配符来实现：
#+BEGIN_SRC 
public void myMethod(List<? extends A> list) {
    //...
}
#+END_SRC
在这个例子中，我们使用上限通配符来限制输入的列表元素必须是 A 类或其子
类的实例。这允许我们传递 ~List<A>~ 、 ~List<B>~ 或 ~List<C>~ 等类型的
列表，但不允许我们传递 ~List<String>~ 等其他类型的列表。

