art/note/j11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-24 Mon 16:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 11:Generics and reflections</title>
<meta name="generator" content="Org mode" />
<link rel = "stylesheet" type="text/css" href ="style_for_org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Chapter 11:Generics and reflections</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd0182ca">1. 泛型</a>
<ul>
<li><a href="#orgd0337c0">1.1. 什么是泛型?</a></li>
<li><a href="#orge566f45">1.2. 能够给我一个泛型类的例子吗?</a></li>
<li><a href="#org2410468">1.3. 能够定义一个有着多个泛型的类吗?</a></li>
<li><a href="#orgd602949">1.4. 泛型方法是什么?</a></li>
<li><a href="#orgd9ca1ab">1.5. 使用泛型的时候有什么约束和限制？</a>
<ul>
<li><a href="#org22f74ba">1.5.1. 泛型参数不能使用在静态上下文中。静态方法或静态变量无法引用泛型类型参数。</a></li>
</ul>
</li>
<li><a href="#orgda09987">1.6. 泛型接口</a></li>
</ul>
</li>
<li><a href="#org79a23c1">2. 泛型的通配符</a>
<ul>
<li><a href="#org6563588">2.1. 什么是泛型的通配符?</a>
<ul>
<li><a href="#org6118868">2.1.1. <code>?</code>, <code>extends</code>, <code>super</code> 通配符.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf63d970">3. 模板方式模式</a>
<ul>
<li><a href="#orgf3cad27">3.1. 什么是模板方式模式</a></li>
<li><a href="#orgc8ffc62">3.2. 优点</a></li>
<li><a href="#org5e40ec8">3.3. Hook</a></li>
</ul>
</li>
<li><a href="#orgdefc8e6">4. Reflection</a>
<ul>
<li><a href="#org115d041">4.1. 什么是反射?</a></li>
<li><a href="#orgaa80459">4.2. <code>Class</code> 类是什么?</a>
<ul>
<li><a href="#org19ea70c">4.2.1. 如何 get 到 <code>foo</code> 的类?</a></li>
<li><a href="#org135c181">4.2.2. 如何创造一个实例?</a></li>
<li><a href="#org89c6e15">4.2.3. <code>newInstance()</code> 方法</a></li>
<li><a href="#orgdcc96f5">4.2.4. <code>Constructor</code></a></li>
<li><a href="#org41d64a7">4.2.5. <code>Declared</code></a></li>
</ul>
</li>
<li><a href="#org8095480">4.3. 优点和缺点</a>
<ul>
<li><a href="#orgc13f04d">4.3.1. 优点:</a></li>
<li><a href="#org81769a9">4.3.2. 缺点:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org69be370">5. 安全的全局单例形式.</a>
<ul>
<li><a href="#orgf08633c">5.1. 反射破坏单例模式</a></li>
<li><a href="#orgfba81f6">5.2. <code>setAccessible()</code> 是什么?</a></li>
</ul>
</li>
<li><a href="#org673d8f0">6. 获取和修改成员变量.</a>
<ul>
<li><a href="#org8bb4407">6.1. Fields</a>
<ul>
<li><a href="#orgc9eb3ce">6.1.1. 什么是 fields?</a></li>
<li><a href="#org9637892">6.1.2. <code>Field</code> 类是什么?</a></li>
</ul>
</li>
<li><a href="#org5ce071d">6.2. Method</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgd0182ca" class="outline-2">
<h2 id="orgd0182ca"><span class="section-number-2">1</span> 泛型</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd0337c0" class="outline-3">
<h3 id="orgd0337c0"><span class="section-number-3">1.1</span> 什么是泛型?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
泛型是一种编程语言特性，它允许在代码中使用未知的类型。通常情况下，泛型允许我们声明一个函数、类或接口时不指定具体类型，而是在调用时才确定类型。这样可以提高代码的可重用性和灵活性，同时也能避免出现类型不匹配的错误。
</p>

<p>
例如，在 Java 中，我们可以声明一个泛型类来表示某个类型的栈（stack）：
</p>

<pre class="example">
public class Stack&lt;T&gt; {
    private T[] elements;
    private int size;

    public void push(T element) {
        // 将元素压入栈顶
    }

    public T pop() {
        // 从栈顶弹出一个元素并返回
    }
}
</pre>
<p>
在上面的例子中， <code>T</code> 是一个类型参数，它表示某个具体的类型。当我们实例
化一个 <code>Stack</code> 对象时，需要为 <code>T</code> 指定一个具体的类型，例如：
</p>
<pre class="example">
Stack&lt;Integer&gt; intStack = new Stack&lt;Integer&gt;();
intStack.push(1);
intStack.push(2);
intStack.pop(); // 返回2
</pre>
<p>
在这个例子中，我们将 <code>T</code> 指定为 <code>Integer</code> 类型，因此 <code>intStack</code> 对象只
能存储整数类型的元素。如果我们尝试将其他类型的元素压入栈中，就会编译错
误。
</p>
</div>
</div>

<div id="outline-container-orge566f45" class="outline-3">
<h3 id="orge566f45"><span class="section-number-3">1.2</span> 能够给我一个泛型类的例子吗?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
如上就是
</p>
</div>
</div>

<div id="outline-container-org2410468" class="outline-3">
<h3 id="org2410468"><span class="section-number-3">1.3</span> 能够定义一个有着多个泛型的类吗?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
可以.
</p>

<p>
是的，可以定义一个使用了多个泛型的类。这种类被称为 "泛型类" 或 "参数化
类型"。在 Java 中，我们可以使用尖括号来指定多个类型参数，例如：
</p>
<pre class="example">
public class Pair&lt;K, V&gt; {
    private K key;
    private V value;

    public Pair(K key, V value) {
        this.key = key;
        this.value = value;
    }

    public K getKey() {
        return key;
    }

    public V getValue() {
        return value;
    }
}
</pre>
<p>
在上面的例子中， <code>Pair</code> 类使用了两个类型参数 <code>K</code> 和 <code>V</code> ，它们分别表示
键和值的类型。当我们实例化一个 <code>Pair</code> 对象时，需要为 <code>K</code> 和 <code>V</code> 指定具
体的类型，例如：
</p>
<pre class="example">
Pair&lt;String, Integer&gt; pair = new Pair&lt;&gt;("foo", 42);
String key = pair.getKey();
Integer value = pair.getValue();
</pre>
<p>
在这个例子中，我们将 <code>K</code> 指定为 <code>String</code> 类型， <code>V</code> 指定为 <code>Integer</code>
类型。因此， <code>pair</code> 对象表示一个字符串键对应一个整数值的键值对。
</p>
</div>
</div>

<div id="outline-container-orgd602949" class="outline-3">
<h3 id="orgd602949"><span class="section-number-3">1.4</span> 泛型方法是什么?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
参数是泛型的方法就是泛型方法.
</p>

<p>
泛型方法是一种使用泛型的方法，它允许在方法中使用未知的类型。通常情况下，
泛型方法用于实现算法或操作，以便能够处理各种类型的数据。
</p>

<p>
例如，在 Java 中，我们可以声明一个泛型方法来比较两个对象的值是否相等：
</p>
<pre class="example">
public static &lt;T&gt; boolean isEqual(T t1, T t2) {
    return t1.equals(t2);
}
</pre>


<p>
在上面的例子中， <code>isEqual ()</code> 方法使用了一个类型参数 <code>T</code> ，它表示某个具体
的类型。当我们调用 <code>isEqual ()</code> 方法时，需要为 <code>T</code> 指定一个具体的类型，例
如：
</p>
<pre class="example">
String str1 = "hello";
String str2 = "world";
boolean result = isEqual(str1, str2);  // 返回false

Integer num1 = 42;
Integer num2 = 42;
boolean result = isEqual(num1, num2);  // 返回true
</pre>

<p>
在这个例子中，我们分别将 <code>str1</code> 和 <code>str2</code> 作为字符串参数传递给
<code>isEqual ()</code> 方法，并将 <code>num1</code> 和 <code>num2</code> 作为整数参数传递给 <code>isEqual
()</code> 方法。由于 <code>isEqual ()</code> 方法使用了泛型，所以它可以接受任何类型的参
数，只要这些参数类提供了 equals () 方法的实现。
</p>
</div>
</div>

<div id="outline-container-orgd9ca1ab" class="outline-3">
<h3 id="orgd9ca1ab"><span class="section-number-3">1.5</span> 使用泛型的时候有什么约束和限制？</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>无法使用基本数据类型作为泛型类型参数。只能使用对应的包装类（如
Integer、Boolean 等）。</li>

<li>无法创建泛型类型参数的实例。例如，不能直接使用 new T() 创建一个泛型
类型参数 T 的实例，因为在编译时无法确定具体的类型。</li>

<li>在运行时无法获取泛型参数的具体类型信息。这是因为 Java 中的泛型是通
过类型擦除来实现的，在编译时会将泛型类型转换为原始类型，并且在运行
时不再保留类型参数的具体信息。</li>

<li>泛型参数不能使用在静态上下文中。静态方法或静态变量无法引用泛型类型
参数。</li>
</ol>
</div>


<div id="outline-container-org22f74ba" class="outline-4">
<h4 id="org22f74ba"><span class="section-number-4">1.5.1</span> 泛型参数不能使用在静态上下文中。静态方法或静态变量无法引用泛型类型参数。</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
这句话的意思是，在静态方法或静态变量中无法使用泛型类型参数。
</p>

<p>
在 Java 中，静态方法和静态变量属于类级别，而不属于对象级别。因此，它们
不能访问对象的实例变量或实例方法，只能访问静态变量和静态方法。而泛型类
型参数是在实例级别上定义的，因此在静态上下文中无法引用泛型类型参数。
</p>

<p>
例如，下面的代码就会编译错误：
</p>
<pre class="example">
public class MyClass&lt;T&gt; {
    private static T staticVar;
    public static void staticMethod(T arg) { // 编译错误：无法在静态上下文中使用泛型类型参数
        // ...
    }
}
</pre>
<p>
解决这个问题的常见方法是将泛型类型参数替换为具体的类型或限定类型。例如，
可以将上面的代码改为：
</p>
<pre class="example">
public class MyClass&lt;T&gt; {
    private static T staticVar; // 可以使用 T 的限定类型
    public static &lt;E&gt; void staticMethod(E arg) { // 可以使用新的类型参数 E
        // ...
    }
}
</pre>
<p>
总之，由于泛型类型参数是在实例级别上定义的，所以在静态上下文中无法使用
它们。必须使用其他方式来代替泛型类型参数，以确保正确地使用静态方法或静
态变量。
</p>
</div>
</div>
</div>


<div id="outline-container-orgda09987" class="outline-3">
<h3 id="orgda09987"><span class="section-number-3">1.6</span> 泛型接口</h3>
<div class="outline-text-3" id="text-1-6">
<p>
泛型接口是一种接口，其定义中使用了一个或多个类型参数来表示具体的类型，
并且这些类型可以在实现该接口的类中指定。通过使用泛型接口，我们可以将接
口与特定类型的实现分离开来，从而提高代码的可重用性和灵活性。在 Java 语
言中，泛型接口可以使用如下语法进行定义：
</p>
<pre class="example">
interface MyInterface&lt;T&gt; {
    T myMethod(T arg);
}
</pre>
<p>
在上面的例子中， <code>MyInterface</code> 是一个泛型接口，它有一个类型参数 <code>T</code> ，
在 <code>myMethod</code> 方法中使用了这个类型参数来表示参数类型和返回值类型。在实
现 <code>MyInterface</code> 接口时，需要指定具体的类型来替换 <code>T</code> 。例如，如果我们
想让 <code>MyInterface</code> 接口的实现类操作字符串类型，可以这样定义：
</p>
<pre class="example">
class MyString implements MyInterface&lt;String&gt; {
    @Override
    public String myMethod(String arg) {
        // ...
    }
}
</pre>
<p>
在这个例子中， <code>MyString</code> 是 <code>MyInterface</code> 接口的实现类，它将 <code>T</code> 替换
为 <code>String</code> 类型，并实现了 <code>myMethod</code> 方法。
</p>


<p>
值得注意的是, 泛型类实现了泛型接口的, 那么类的泛型的符号应该和接口的泛
型的符号一致.
</p>
</div>
</div>
</div>

<div id="outline-container-org79a23c1" class="outline-2">
<h2 id="org79a23c1"><span class="section-number-2">2</span> 泛型的通配符</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6563588" class="outline-3">
<h3 id="org6563588"><span class="section-number-3">2.1</span> 什么是泛型的通配符?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
泛型的通配符指的是 Java 中用于表示未知类型的符号。它们允许我们编写可以
处理不同数据类型的代码，从而提高了代码的重用性和灵活性。
</p>

<p>
Java 中有两种形式的泛型通配符：问号（ <code>?</code> ）和上限通配符（ <code>extends</code> ）。
</p>

<p>
问号通配符（ <code>?</code> ）可以用来表示任何类型，例如：
</p>
<pre class="example">
List&lt;?&gt; list;
</pre>

<p>
在这个例子中，我们定义了一个 <code>List</code> 类型的变量 <code>list</code> ，并使用问号通配
符来指示它可以持有任何类型的元素。这意味着我们可以将任何类型的列表分配
给此变量，例如 <code>List&lt;String&gt;</code> 或 <code>List&lt;Integer&gt;</code> 等。
</p>

<p>
上限通配符（ <code>extends</code> ）用于限制泛型类型参数的范围。例如，假设我们有
以下类层次结构：
</p>
<pre class="example">
class A {}
class B extends A {}
class C extends A {}
</pre>
<p>
现在，我们想要一个方法来接受一个 <code>List</code> ，该列表只包含 <code>A</code> 类及其子类
的对象。我们可以使用上限通配符来实现：
</p>
<pre class="example">
public void myMethod(List&lt;? extends A&gt; list) {
    //...
}
</pre>
<p>
在这个例子中，我们使用上限通配符来限制输入的列表元素必须是 A 类或其子
类的实例。这允许我们传递 <code>List&lt;A&gt;</code> 、 <code>List&lt;B&gt;</code> 或 <code>List&lt;C&gt;</code> 等类型的
列表，但不允许我们传递 <code>List&lt;String&gt;</code> 等其他类型的列表。
</p>
</div>
