art/note/j11.html

<div id="outline-container-org6118868" class="outline-4">
<h4 id="org6118868"><span class="section-number-4">2.1.1</span> <code>?</code>, <code>extends</code>, <code>super</code> 通配符.</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
在 Java 中，泛型通配符用于指定泛型类型参数的类型范围。Java 的泛型通配符有以下几种：
</p>

<ol class="org-ol">
<li>无限定通配符：用 <code>?</code> 表示，表示可以匹配任意类型，相当于不指定泛型类型。</li>

<li>上界通配符：使用 <code>extends</code> 关键字，用于限制泛型类型必须是某个类或其
子类。</li>
</ol>
<pre class="example">
public class Box&lt;T&gt; {
    public void process(Box&lt;? extends T&gt; box) {
        // ...
    }
}
</pre>
<ol class="org-ol">
<li>下界通配符：使用 <code>super</code> 关键字，用于限制泛型类型必须是某个类的父类
（包括该类本身）。</li>
</ol>
<pre class="example">
public class Box&lt;T&gt; {
    public void add(T t, Box&lt;? super T&gt; box) {
        // ...
    }
}
</pre>
<p>
需要注意的是，使用通配符会降低泛型类型的精确度，从而可能导致一些编译时
错误。因此，在应用泛型通配符时，需要特别小心，并且视情况选择合适的方式
来使用泛型通配符。
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf63d970" class="outline-2">
<h2 id="orgf63d970"><span class="section-number-2">3</span> 模板方式模式</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf3cad27" class="outline-3">
<h3 id="orgf3cad27"><span class="section-number-3">3.1</span> 什么是模板方式模式</h3>
<div class="outline-text-3" id="text-3-1">
<p>
模板方法模式（Template Method Pattern）是一种行为型设计模式。在模板方
法模式中，定义一个抽象类，其中包含了若干个子步骤的实现方式，并且这些子
步骤的执行顺序已经确定。但是，某些具体的子步骤的实现方式可能会因为不同
的场景而有所不同，这些具体的实现方式可以由子类来实现。
</p>

<p>
换句话说，模板方法模式提供了一个结构框架，而具体的实现方式则由子类来决
定。这样可以避免代码重复，同时也方便了代码的扩展和维护。
</p>

<p>
模板方法模式通常包含以下角色：
</p>

<ol class="org-ol">
<li>抽象类（Abstract Class）：含有若干个子步骤的执行方式，并且定义了一个模</li>
</ol>
<p>
板方法，该方法定义了子步骤的执行顺序以及如何执行。
</p>

<ol class="org-ol">
<li>具体类（Concrete Class）：实现了抽象类中的某些子步骤的具体实现方式。</li>
</ol>

<p>
下面是一个简单的模板方法模式示例：
</p>

<pre class="example">
public abstract class AbstractClass {
    public void templateMethod() {
        doStepOne();
        doStepTwo();
        doStepThree();
    }

    protected abstract void doStepOne();

    protected abstract void doStepTwo();

    protected abstract void doStepThree();
}

public class ConcreteClass extends AbstractClass {
    @Override
    protected void doStepOne() {
        System.out.println("Step One in Concrete Class");
    }

    @Override
    protected void doStepTwo() {
        System.out.println("Step Two in Concrete Class");
    }

    @Override
    protected void doStepThree() {
        System.out.println("Step Three in Concrete Class");
    }
}

public class Main {
    public static void main(String[] args) {
        AbstractClass abstractClass = new ConcreteClass();
        abstractClass.templateMethod();
    }
}
</pre>
<p>
在上述示例中，抽象类 <code>AbstractClass</code> 定义了一个模板方法
<code>templateMethod()</code> ，其中包含了三个子步骤的执行方式。具体的实现方式则
由子类来决定，这里我们定义了一个具体类 <code>ConcreteClass</code> ，它实现了抽象
类中的三个子步骤的具体实现方式。最后，在 <code>Main</code> 类中创建一个
<code>ConcreteClass</code> 对象，并调用其模板方法 <code>templateMethod()</code> 。
</p>
</div>
</div>

<div id="outline-container-orgc8ffc62" class="outline-3">
<h3 id="orgc8ffc62"><span class="section-number-3">3.2</span> 优点</h3>
<div class="outline-text-3" id="text-3-2">
<p>
模板方法模式的主要优点如下：
</p>

<ol class="org-ol">
<li>提高代码复用性：模板方法模式将一些共性的代码抽象出来放在父类中，避
免了重复编写相同的代码，提高了代码的复用性和可维护性。</li>

<li>符合开闭原则：通过抽象出算法框架和具体实现的分离，可以方便地扩展或
修改算法的具体实现部分，符合开闭原则。</li>

<li>可以控制子类的扩展：由于模板方法定义了算法的基本骨架和流程，因此可
以控制子类对算法步骤的修改和扩展，从而保证算法的稳定性和正确性。</li>

<li>便于维护：由于模板方法将算法的基本框架和具体实现分离，因此可以很容
易地修改和扩展算法的具体实现，同时也方便了代码的维护和管理。</li>
</ol>

<p>
总之，模板方法模式是一种非常有用的设计模式，它能够提高代码的复用性、可
维护性和扩展性，可以使系统更加灵活和易于维护。
</p>
</div>
</div>

<div id="outline-container-org5e40ec8" class="outline-3">
<h3 id="org5e40ec8"><span class="section-number-3">3.3</span> Hook</h3>
<div class="outline-text-3" id="text-3-3">
<p>
"Hook operation" 是模板方法模式中的一个概念，它指的是一种可以在基类中
定义但不是必须实现的操作，在模板方法中会调用这些操作，而具体的实现可以
由子类覆盖或者提供默认实现。
</p>

<p>
具体来说，在模板方法中，通常有一部分操作是固定的，这些操作在基类中被实
现。另外还有一些操作可能是可选的，这些可选操作就是 "hook operation"。
基类中会为这些操作提供默认实现，但是子类可以选择覆盖这些操作，以便根据
自己的需要来实现特定的功能。
</p>

<p>
使用 "hook operation" 可以让父类和子类之间达成一种契约或协议，即父类定
义好了算法的基础框架，并提供了一些可选的扩展点（即 "hook operation"），
子类可以根据自己的需求来选择实现或继承这些扩展点，从而实现各自的算法扩
展和定制。这样可以方便地扩展和定制算法，同时也避免了代码的重复编写，提
高了代码的复用性和可维护性。
</p>
</div>
</div>
</div>

<div id="outline-container-orgdefc8e6" class="outline-2">
<h2 id="orgdefc8e6"><span class="section-number-2">4</span> Reflection</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org115d041" class="outline-3">
<h3 id="org115d041"><span class="section-number-3">4.1</span> 什么是反射?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
在 Java 中，反射（Reflection）是指在运行时动态地获取一个类的信息，并可
以操作其属性、方法和构造函数等相关内容的机制。Java 的反射机制使得程序
可以在运行时动态地加载、检查和调用类的任意方法和属性，而不需要预先知道
这些信息。
</p>

<p>
Java 中的反射机制允许通过以下方式来获得类的详细信息：
</p>

<ol class="org-ol">
<li>获取 <code>Class</code> 对象：使用 <code>Class.forName ()</code> 或者 <code>.class</code> 等方式获取
表示类的 <code>Class</code> 对象。</li>

<li>获取构造函数：使用 <code>Class.getConstructor ()</code> 或
<code>Class.getDeclaredConstructor ()</code> 方法获取类的构造函数对象。</li>

<li>获取类的属性：使用 <code>Class.getField ()</code> 或者 <code>Class.getDeclaredField
   ()</code> 方法获取类的属性对象。</li>

<li>获取类的方法：使用 <code>Class.getMethod ()</code> 或 <code>Class.getDeclaredMethod ()</code>
方法获取类的方法对象。</li>

<li>动态创建对象：使用 <code>Constructor.newInstance ()</code> 方法来动态地创建一个
类的实例对象。</li>
</ol>

<p>
反射机制可以使得程序更加灵活和通用化，因为它允许程序在运行时才去动态地
获取类的信息和执行相应的操作，从而具有了更大的自由度和可定制性。但是，
反射机制也可能会带来一些性能上的损失和安全风险，因此需要根据实际情况进
行权衡和选择。
</p>
</div>
</div>

<div id="outline-container-orgaa80459" class="outline-3">
<h3 id="orgaa80459"><span class="section-number-3">4.2</span> <code>Class</code> 类是什么?</h3>
<div class="outline-text-3" id="text-4-2">
<p>
假设我们有一个类, 称为 <code>Student</code>. 有一个同学称为 <code>foo</code>, 他是一个
<code>Student</code> 我们可以这样 get 到这个 <code>Student</code> 类. 然后进行操作.
</p>

<pre class="example">
Class fooClass = foo.getClass();
</pre>

<p>
那么 <code>fooClass</code> 就得到了 <code>foo</code> 的类的信息. 可以进行一些操作. 这里举出
一个例子:
</p>

<pre class="example">
bar = fooClass.newInstance(); // newInstance 的执行是有条件的.
</pre>

<p>
这样我们就新建了一个 <code>bar</code> 其具有 <code>foo</code> 相同的类. 
</p>
</div>

<div id="outline-container-org19ea70c" class="outline-4">
<h4 id="org19ea70c"><span class="section-number-4">4.2.1</span> 如何 get 到 <code>foo</code> 的类?</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
有三种方法: 
</p>
<ol class="org-ol">
<li>调用 <code>foo.getClass()</code>, 其返回值是 <code>foo</code> 的类. 下同.</li>
<li>调用 <code>Class.forName(className)</code>, 其中 <code>className</code> 是一个 <code>String</code>.</li>
<li>访问 <code>ClassName.class</code>, 其中, <code>ClassName</code> 是某个类, 比如说
<code>String</code>, 之类的, 那么对应的方法便是 <code>String.class</code>.</li>
</ol>

<p>
值得注意的是, 一个类的不同实例的 <code>getClass()</code> 的返回值是不一样的. 但是 <code>ClassName.class</code> 是一样的. 
</p>
</div>
</div>

<div id="outline-container-org135c181" class="outline-4">
<h4 id="org135c181"><span class="section-number-4">4.2.2</span> 如何创造一个实例?</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
也有三种方法
</p>
<ol class="org-ol">
<li>调用 <code>Class</code> 的 <code>newInstance()</code> 方法.</li>
<li>找到 <code>Class</code> 的 <code>Constructor</code>. 调用 <code>Constructor</code> 来构造实例.</li>
</ol>
</div>
</div>

<div id="outline-container-org89c6e15" class="outline-4">
<h4 id="org89c6e15"><span class="section-number-4">4.2.3</span> <code>newInstance()</code> 方法</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
这是 <code>(Class)</code> 之中的一个方法 (我使用括号表示说, 这是一个 Class 类的实
例). 其调用的是 <b>默认构造方法</b>.
</p>
</div>
</div>

<div id="outline-container-orgdcc96f5" class="outline-4">
<h4 id="orgdcc96f5"><span class="section-number-4">4.2.4</span> <code>Constructor</code></h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
我们调用 <code>(Class)</code> 的两个方法: <code>getConstructors()</code>, <code>getDeclaredConstructors()</code>. 来获取一个 <code>Constructor</code> 类型的数组. 
因为 Constructor 可能有很多个. 
</p>

<p>
随后我们可以调用 <code>getConstructor(/* could be argument */)</code> 来找到特定的 Constructor. 
</p>
</div>
</div>

<div id="outline-container-org41d64a7" class="outline-4">
<h4 id="org41d64a7"><span class="section-number-4">4.2.5</span> <code>Declared</code></h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
<code>Declared</code> 说明这方法能够得到所有的已经声明的构造函数, 就是说, 其包括
私有的构造函数, 也有别的构造函数.
</p>
</div>
</div>
</div>

<div id="outline-container-org8095480" class="outline-3">
<h3 id="org8095480"><span class="section-number-3">4.3</span> 优点和缺点</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgc13f04d" class="outline-4">
<h4 id="orgc13f04d"><span class="section-number-4">4.3.1</span> 优点:</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
比较灵活, 能够在运行的时候动态地获取类的实例
</p>
</div>
</div>

<div id="outline-container-org81769a9" class="outline-4">
<h4 id="org81769a9"><span class="section-number-4">4.3.2</span> 缺点:</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
性能问题: 反射相当于一系列的解析操作, 通知 JVM 要做的事情, 性能差
</p>

<p>
安全问题: 反射机制破坏了封装性.
</p>
</div>
</div>
</div>
</div>
