art/note/j11.org
** 反射破坏单例模式

单例的目的在于, 其一个类只有一个实例. 但是反射将破坏单例.

在 Java 中，反射可以通过访问私有构造函数来破坏单例模式。当一个类的构造
函数被声明为私有时，它不能被外部类访问，这意味着只能通过该类的静态方法
获取其实例。但是，使用反射，可以绕过这个限制并强制调用私有构造函数，从
而创建多个实例。

下面是一个简单的示例，演示了如何使用反射破坏单例模式：
#+BEGIN_SRC 
public class Singleton {
    private static Singleton instance = new Singleton();

    private Singleton() {
        /* mechanism deal with the problem */
        /* if (instance != null) {
            throw new IllegalStateException("Already instantiated");
        }
        */
    }

    public static Singleton getInstance() {
        return instance;
    }
}

public class Main {
    public static void main(String[] args) throws Exception {
        Singleton singleton1 = Singleton.getInstance();
        Singleton singleton2 = null;

        Constructor<Singleton> constructor = Singleton.class.getDeclaredConstructor();
        constructor.setAccessible(true);
        singleton2 = constructor.newInstance();

        System.out.println(singleton1.hashCode());
        System.out.println(singleton2.hashCode());
    }
}
#+END_SRC
在上面的示例代码中，我们首先获取一个 ~Singleton~ 类的实例，并将其赋值
给变量 ~singleton1~ 。然后，我们使用反射获取 ~Singleton~ 类的构造函数，
并将其设置为可访问。接下来，我们使用构造函数创建一个新的 ~Singleton~
实例，并将其赋值给变量 ~singleton2~ 。最后，我们比较两个对象的哈希码，
发现它们不同，这证明我们成功地使用反射创建了另一个 ~Singleton~ 实例，
从而破坏了单例模式。

** ~setAccessible()~ 是什么?

这行代码是设置构造函数的可访问性，使得即使该构造函数被声明为私有的，也
可以被反射机制访问。默认情况下，Java 会通过反射来访问类的公共成员，但
对于私有成员（包括构造函数），需要将其设置为可访问才能使用反射操作。

在上面的示例代码中，我们使用 ~getDeclaredConstructor()~ 方法获取
~Singleton~ 类的构造函数对象，并将其存储在 ~Constructor<Singleton>~ 类
型的变量中。然后，我们调用 ~setAccessible(true)~ 方法将构造函数对象设
置为可访问状态。这意味着即使该构造函数是私有的，我们也可以通过它创建新
的对象实例

* 获取和修改成员变量. 

** Fields

*** 什么是 fields?

实际上存储在类之中对变量就是 fields.

*** ~Field~ 类是什么?

~Field~ 类是设置一个类的 fields 的值的类, 当然其能够进行其他的操作. 比
如说返回某一个类的 ~field~. 对应这两种方法: 1. ~set()~ 方法
和 2. ~get()~ 方法.

可以认为 ~Field~ 类是一个设置器, 我们先告诉他 "要设置哪个", 然后告诉他, "设置谁" 的 fields.

**** ~get()~ 方法是什么?

比如说我们首先获取一个类的 field 对应的 ~Field~ 类型. 比如说, 

#+BEGIN_SRC 
Field f = Student.class.getDeclaredField("name");
#+END_SRC

~Student~ 类是这样初始化的, ~new Student("name", id)~. 随后我们设置 ~setAccessible~ , 让其能够达到.

#+BEGIN_SRC 
f.setAccessible(true);
#+END_SRC

然后调用 ~f~ 的 ~get(Class)~ 方法就能够返回 ~f~ 对应的 ~field~ , 在某一个类之中的对应值. 

#+BEGIN_SRC 
System.out.println(f.get(Class));
#+END_SRC

就打印了对应的变量名的.

**** ~set()~ 是什么? 

我们使用 ~set(Class, value)~ 在设置某一个类的特定的特征的值. 具体为

#+BEGIN_SRC 
f.set(student, "shit");
#+END_SRC

会将 ~student~ 的名字设置为 ~shit~.

** Method

通过 Invoke 来调用类内部的方法. 类似的, 我们应该先告诉他, "调用哪个方
法", 然后告诉他, "通过哪个实例调用, 以什么参数调用".

比如说我们有一个 ~Student~ 类的 ~student~. 我们通过调用 ~Student~ Class 类的 ~getMethod()~ 方法得到内部的方法. 

#+BEGIN_SRC 
Method m = Student.class.getMethod("getName");
#+END_SRC

这就是说, 其得到了方法 ~getName~. 随后我们通过 ~invoke~ 来调用方法. 其
中 ~invoke~ 有 1 到多个变量. 第一个变量是 *执行这个方法的对象*, 剩余的可
能的变量是这个方法的参数.

#+BEGIN_SRC 
m.invoke(student);
#+END_SRC

这段代码就将执行 ~getName()~ 方法, 执行的实例是 ~student~, 返回值有可能是 "shit".

值得注意的是, 其返回值是 ~Object~ 好理解, 因为 ~Method~ 类是一种抹去了
细节的实现, 那么面对多种可能的返回值, 他直接将类型抹为 ~Object~.    