art/note/j11.html

<div id="outline-container-org69be370" class="outline-2">
<h2 id="org69be370"><span class="section-number-2">5</span> 安全的全局单例形式.</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf08633c" class="outline-3">
<h3 id="orgf08633c"><span class="section-number-3">5.1</span> 反射破坏单例模式</h3>
<div class="outline-text-3" id="text-5-1">
<p>
单例的目的在于, 其一个类只有一个实例. 但是反射将破坏单例.
</p>

<p>
在 Java 中，反射可以通过访问私有构造函数来破坏单例模式。当一个类的构造
函数被声明为私有时，它不能被外部类访问，这意味着只能通过该类的静态方法
获取其实例。但是，使用反射，可以绕过这个限制并强制调用私有构造函数，从
而创建多个实例。
</p>

<p>
下面是一个简单的示例，演示了如何使用反射破坏单例模式：
</p>
<pre class="example">
public class Singleton {
    private static Singleton instance = new Singleton();

    private Singleton() {
        /* mechanism deal with the problem */
        /* if (instance != null) {
            throw new IllegalStateException("Already instantiated");
        }
        */
    }

    public static Singleton getInstance() {
        return instance;
    }
}

public class Main {
    public static void main(String[] args) throws Exception {
        Singleton singleton1 = Singleton.getInstance();
        Singleton singleton2 = null;

        Constructor&lt;Singleton&gt; constructor = Singleton.class.getDeclaredConstructor();
        constructor.setAccessible(true);
        singleton2 = constructor.newInstance();

        System.out.println(singleton1.hashCode());
        System.out.println(singleton2.hashCode());
    }
}
</pre>
<p>
在上面的示例代码中，我们首先获取一个 <code>Singleton</code> 类的实例，并将其赋值
给变量 <code>singleton1</code> 。然后，我们使用反射获取 <code>Singleton</code> 类的构造函数，
并将其设置为可访问。接下来，我们使用构造函数创建一个新的 <code>Singleton</code>
实例，并将其赋值给变量 <code>singleton2</code> 。最后，我们比较两个对象的哈希码，
发现它们不同，这证明我们成功地使用反射创建了另一个 <code>Singleton</code> 实例，
从而破坏了单例模式。
</p>
</div>
</div>

<div id="outline-container-orgfba81f6" class="outline-3">
<h3 id="orgfba81f6"><span class="section-number-3">5.2</span> <code>setAccessible()</code> 是什么?</h3>
<div class="outline-text-3" id="text-5-2">
<p>
这行代码是设置构造函数的可访问性，使得即使该构造函数被声明为私有的，也
可以被反射机制访问。默认情况下，Java 会通过反射来访问类的公共成员，但
对于私有成员（包括构造函数），需要将其设置为可访问才能使用反射操作。
</p>

<p>
在上面的示例代码中，我们使用 <code>getDeclaredConstructor()</code> 方法获取
<code>Singleton</code> 类的构造函数对象，并将其存储在 <code>Constructor&lt;Singleton&gt;</code> 类
型的变量中。然后，我们调用 <code>setAccessible(true)</code> 方法将构造函数对象设
置为可访问状态。这意味着即使该构造函数是私有的，我们也可以通过它创建新
的对象实例
</p>
</div>
</div>
</div>

<div id="outline-container-org673d8f0" class="outline-2">
<h2 id="org673d8f0"><span class="section-number-2">6</span> 获取和修改成员变量.</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org8bb4407" class="outline-3">
<h3 id="org8bb4407"><span class="section-number-3">6.1</span> Fields</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgc9eb3ce" class="outline-4">
<h4 id="orgc9eb3ce"><span class="section-number-4">6.1.1</span> 什么是 fields?</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
实际上存储在类之中对变量就是 fields.
</p>
</div>
</div>

<div id="outline-container-org9637892" class="outline-4">
<h4 id="org9637892"><span class="section-number-4">6.1.2</span> <code>Field</code> 类是什么?</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
<code>Field</code> 类是设置一个类的 fields 的值的类, 当然其能够进行其他的操作. 比
如说返回某一个类的 <code>field</code>. 对应这两种方法: 1. <code>set()</code> 方法
和 2. <code>get()</code> 方法.
</p>

<p>
可以认为 <code>Field</code> 类是一个设置器, 我们先告诉他 "要设置哪个", 然后告诉他, "设置谁" 的 fields.
</p>
</div>

<ol class="org-ol">
<li><a id="orgb3c82c0"></a><code>get()</code> 方法是什么?<br />
<div class="outline-text-5" id="text-6-1-2-1">
<p>
比如说我们首先获取一个类的 field 对应的 <code>Field</code> 类型. 比如说, 
</p>

<pre class="example">
Field f = Student.class.getDeclaredField("name");
</pre>

<p>
<code>Student</code> 类是这样初始化的, <code>new Student("name", id)</code>. 随后我们设置 <code>setAccessible</code> , 让其能够达到.
</p>

<pre class="example">
f.setAccessible(true);
</pre>

<p>
然后调用 <code>f</code> 的 <code>get(Class)</code> 方法就能够返回 <code>f</code> 对应的 <code>field</code> , 在某一个类之中的对应值. 
</p>

<pre class="example">
System.out.println(f.get(Class));
</pre>

<p>
就打印了对应的变量名的.
</p>
</div>
</li>

<li><a id="org6c79951"></a><code>set()</code> 是什么?<br />
<div class="outline-text-5" id="text-6-1-2-2">
<p>
我们使用 <code>set(Class, value)</code> 在设置某一个类的特定的特征的值. 具体为
</p>

<pre class="example">
f.set(student, "shit");
</pre>

<p>
会将 <code>student</code> 的名字设置为 <code>shit</code>.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org5ce071d" class="outline-3">
<h3 id="org5ce071d"><span class="section-number-3">6.2</span> Method</h3>
<div class="outline-text-3" id="text-6-2">
<p>
通过 Invoke 来调用类内部的方法. 类似的, 我们应该先告诉他, "调用哪个方
法", 然后告诉他, "通过哪个实例调用, 以什么参数调用".
</p>

<p>
比如说我们有一个 <code>Student</code> 类的 <code>student</code>. 我们通过调用 <code>Student</code> Class 类的 <code>getMethod()</code> 方法得到内部的方法. 
</p>

<pre class="example">
Method m = Student.class.getMethod("getName");
</pre>

<p>
这就是说, 其得到了方法 <code>getName</code>. 随后我们通过 <code>invoke</code> 来调用方法. 其
中 <code>invoke</code> 有 1 到多个变量. 第一个变量是 <b>执行这个方法的对象</b>, 剩余的可
能的变量是这个方法的参数.
</p>

<pre class="example">
m.invoke(student);
</pre>

<p>
这段代码就将执行 <code>getName()</code> 方法, 执行的实例是 <code>student</code>, 返回值有可能是 "shit".
</p>

<p>
值得注意的是, 其返回值是 <code>Object</code> 好理解, 因为 <code>Method</code> 类是一种抹去了
细节的实现, 那么面对多种可能的返回值, 他直接将类型抹为 <code>Object</code>.</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-24 Mon 16:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>